
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Java内存分区 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1-02.java 常量池相关 String Integer.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    Java
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="1-01.java内存分区.html">
            
                <a href="1-01.java内存分区.html">
            
                    
                    Java内存分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="1-02.java 常量池相关 String Integer.html">
            
                <a href="1-02.java 常量池相关 String Integer.html">
            
                    
                    Java 常量池相关
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <span>
            
                    
                    Tool
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../Tools/使用Gitpages发布GitBook.html">
            
                <a href="../Tools/使用Gitpages发布GitBook.html">
            
                    
                    Git使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../Tools/Android Debug Tools.html">
            
                <a href="../Tools/Android Debug Tools.html">
            
                    
                    Android Debug Tools
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Java内存分区</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="java&#x5185;&#x5B58;&#x5206;&#x533A;">java&#x5185;&#x5B58;&#x5206;&#x533A;</h3>
<p>Java&#x865A;&#x62DF;&#x673A;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4F1A;&#x628A;jvm&#x7684;&#x5185;&#x5B58;&#x5206;&#x4E3A;&#x82E5;&#x5E72;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x533A;&#x57DF;&#x6765;&#x7BA1;&#x7406;&#xFF0C;&#x8FD9;&#x4E9B;&#x533A;&#x57DF;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x4EE5;&#x53CA;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x7684;&#x968F;&#x7740;jvm&#x8FDB;&#x7A0B;&#x7684;&#x542F;&#x52A8;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x6709;&#x7684;&#x5219;&#x662F;&#x4F9D;&#x8D56;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x7684;&#x542F;&#x52A8;&#x548C;&#x7ED3;&#x675F;&#x800C;&#x5EFA;&#x7ACB;&#x548C;&#x9500;&#x6BC1;&#x3002;</p>
<p><img src="http://cdn.jiweichengzhu.com/upload/image/20190228/a29b4b33-4c33-4612-9adb-252b06d61807.jpg" alt="image"></p>
<h4 id="&#x5171;&#x4EAB;&#x6570;&#x636E;&#x533A;&#xFF1A;">&#x5171;&#x4EAB;&#x6570;&#x636E;&#x533A;&#xFF1A;</h4>
<ul>
<li>&#x65B9;&#x6CD5;&#x533A;&#x4E00;&#x822C;&#x5B58;&#x50A8;&#x5DF2;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6B64;&#x533A;&#x57DF;&#x4E5F;&#x4F1A;&#x6709;GC&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x9891;&#x7E41;&#x89E6;&#x53D1;&#xFF0C;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x9488;&#x5BF9;&#x5E38;&#x91CF;&#x6C60;&#x7684;&#x56DE;&#x6536;&#x548C;&#x5BF9;&#x7C7B;&#x578B;&#x7684;&#x5378;&#x8F7D;</li>
</ul>
<blockquote>
<p>JDK6&#x4E2D;&#x5E38;&#x91CF;&#x6C60;&#x5728;&#x65B9;&#x6CD5;&#x533A; JDK7&#x5E38;&#x91CF;&#x6C60;&#x5728;&#x5806;</p>
</blockquote>
<ul>
<li>&#x5806;:JVM&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x5360;&#x6BD4;&#x6700;&#x5927;&#x7684;&#x4E00;&#x5757;&#x533A;&#x57DF;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x65F6;&#x521B;&#x5EFA;&#xFF0C;&#x552F;&#x4E00;&#x76EE;&#x7684;&#x662F;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x5185;&#x5B58;&#x3002;&#xFF08;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6210;&#x5458;&#x53D8;&#x91CF; &#xFF09;&#xFF0C;</li>
</ul>
<p><img src="http://cdn.jiweichengzhu.com/upload/image/20190301/w/bd1850e1-e74c-4d65-ab35-e163a21a9be6.jpg" alt="image"></p>
<p>Java&#x5806;&#x4E3B;&#x4F53;&#x5206;&#x4E3A;</p>
<ul>
<li><p>&#x65B0;&#x751F;&#x4EE3;&#xFF1A; eden survoir0  survor1 &#x6309;&#x7167;8&#xFF1A;1&#xFF1A;1&#x5206;&#x914D;&#x3002; &#x590D;&#x5236;&#x6E05;&#x9664;&#x7B97;&#x6CD5;</p>
</li>
<li><p>&#x8001;&#x5E74;&#x4EE3;&#xFF1A;&#x5B58;&#x653E;&#x5927;&#x5BF9;&#x8C61;&#x3001;&#x7ECF;&#x8FC7;Minor GC15&#x6B21;&#x7684;&#x5BF9;&#x8C61;   &#x6807;&#x8BB0;&#x6574;&#x7406;&#x7B97;&#x6CD5;</p>
</li>
</ul>
<h4 id="&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#xFF1A;">&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#xFF1A;</h4>
<ul>
<li>&#x6808;:&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4ECE;&#x8C03;&#x7528;&#x5230;&#x6267;&#x884C;&#x5B8C;&#x6210;&#xFF0C;&#x5C31;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x5728;&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E2D;&#x7684;&#x5165;&#x6808;&#x548C;&#x5230;&#x51FA;&#x6808;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6808;&#x7684;&#x7ED3;&#x6784;&#x662F;&#x6808;&#x5E27;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x65F6;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x671F;&#x95F4;&#x6240;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5305;&#x542B;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#xFF0C;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#xFF0C;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#xFF0C;&#x65B9;&#x6CD5;&#x51FA;&#x53E3;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x5305;&#x542B;&#x7740;&#x5404;&#x79CD;&#x7F16;&#x8BD1;&#x671F;&#x5DF2;&#x77E5;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x548C;returnAddress&#x3002;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5C31;&#x662F;Java&#x7684;8&#x5927;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;boolean,byte,char, short, int, float, long, double&#xFF09;,&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x6307;&#x5411;&#x5B9E;&#x9645;&#x5BF9;&#x8C61;&#x5730;&#x5740;&#x7684;&#x6307;&#x9488;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x53E5;&#x67C4;&#xFF0C;returnAddress&#x5219;&#x662F;&#x4E00;&#x6761;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;&#x3002;</li>
</ul>
<ul>
<li><p>&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;:&#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E3A;&#x6267;&#x884C;java&#x65B9;&#x6CD5;&#xFF08;&#x5B57;&#x8282;&#x7801;&#xFF09;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x5219;&#x662F;&#x4E3A;&#x6267;&#x884C;&#x672C;&#x5730;Native&#x65B9;&#x6CD5;&#x670D;&#x52A1;&#x3002;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;:&#x4E00;&#x5757;&#x8F83;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6240;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7684;&#x884C;&#x53F7;&#x6307;&#x793A;&#x5668;&#x3002;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x662F;&#x5E76;&#x975E;&#x6709;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x7ADE;&#x4E89;CPU&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x540E;&#x80FD;&#x6062;&#x590D;&#x5230;&#x6B63;&#x786E;&#x7684;&#x6267;&#x884C;&#x4F4D;&#x7F6E;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#xFF0C;&#x72EC;&#x7ACB;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x5757;&#x513F;&#x533A;&#x57DF;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x201C;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x5185;&#x5B58;&#x201D;&#xFF0C;&#x6B64;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x5728;jvm&#x89C4;&#x8303;&#x4E2D;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x4EFB;&#x4F55;OutOfMemoryError&#x7684;&#x533A;&#x57DF;&#x3002;</p>
</li>
</ul>
<ul>
<li>&#x76F4;&#x63A5;&#x5185;&#x5B58;
&#x4E0D;&#x5C5E;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;Java NIO&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x901A;&#x9053;&#x4E0E;&#x7F13;&#x51B2;&#x533A;&#x7684;IO&#x65B9;&#x5F0F;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Native&#x51FD;&#x6570;&#x5E93;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x5806;&#x5916;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x5728;Java&#x5806;&#x4E2D;&#x7684;DirectByteBuffer&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x8FD9;&#x5757;&#x5185;&#x5B58;&#x7684;&#x5F15;&#x7528;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x907F;&#x514D;Java&#x5806;&#x548C;Native&#x5806;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x590D;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x573A;&#x666F;&#x4E2D;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x7531;&#x4E8E;&#x4E0D;&#x5728;&#x5806;&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x53D7;&#x5230;&#x5806;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x3002;&#x4F46;&#x65E2;&#x7136;&#x662F;&#x5185;&#x5B58;&#x603B;&#x6709;&#x4F1A;&#x88AB;&#x7528;&#x5B8C;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x629B;&#x51FA;OutOfMemoryError&#x3002;</li>
</ul>
<hr>
<h4 id="java&#x4E2D;&#x5806;&#x548C;&#x6808;&#x7684;&#x533A;&#x522B;">java&#x4E2D;&#x5806;&#x548C;&#x6808;&#x7684;&#x533A;&#x522B;</h4>
<p>&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6808;&#x5185;&#x5B58;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF0C;&#x65B9;&#x6CD5;&#x53C2;&#x6570;&#x548C;&#x6808;&#x8C03;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x800C;&#x5806;&#x662F;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x4E00;&#x7247;&#x516C;&#x7528;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x3002;&#x5BF9;&#x8C61;&#x90FD;&#x5728;&#x5806;&#x91CC;&#x521B;&#x5EFA;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x6548;&#x7387;&#x7EBF;&#x7A0B;&#x4F1A;&#x4ECE;&#x5806;&#x4E2D;&#x5F04;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6808;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x5C31;&#x53EF;&#x80FD;&#x5F15;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x65F6;volatile &#x53D8;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;&#x5B83;&#x8981;&#x6C42;&#x7EBF;&#x7A0B;&#x4ECE;&#x4E3B;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;</p>
<p>stack&#xFF1A;</p>
<blockquote>
<p>&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x90FD;&#x6709;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x6BB5;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x3001;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x7684;PC&#x503C;&#x7684;&#x4FDD;&#x5B58;&#x3002;&#x8FD9;&#x53EB;stack&#x3002; </p>
</blockquote>
<p>heap&#xFF1A;</p>
<blockquote>
<p>&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5171;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x4E2D;&#x7533;&#x8BF7;&#x4F9B;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E2A;&#x5171;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x53EB;heap&#x3002; </p>
</blockquote>
<ul>
<li>Stack&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x4EC5;&#x6B21;&#x4E8E;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;Stack&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x53EF;&#x5171;&#x4EAB;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x751F;&#x5B58;&#x671F;&#x5FC5;&#x987B;&#x5728;&#x8FD0;&#x884C;&#x524D;&#x786E;&#x5B9A;&#x3002;</li>
<li><p>Heap&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x52A8;&#x6001;&#x5206;&#x914D;&#x7684;&#x6570;&#x636E;&#x533A;&#xFF0C;&#x4ECE;&#x901F;&#x5EA6;&#x770B;&#x6BD4;Stack&#x6162;&#xFF0C;Heap&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x5171;&#x4EAB;&#xFF0C;&#x5927;&#x5C0F;&#x548C;&#x751F;&#x5B58;&#x671F;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x786E;&#x5B9A;</p>
</li>
<li><p>&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x90FD;&#x5728;&#x51FD;&#x6570;&#x7684;&#x6808;&#x5185;&#x5B58;&#x4E2D;&#x5206;&#x914D;</p>
</li>
<li>&#x5806;&#x5185;&#x5B58;&#x7528;&#x6765;&#x5B58;&#x653E;&#x7531;new&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x6570;&#x7EC4;&#xFF0C;&#x5728;&#x5806;&#x4E2D;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x7531;Java&#x865A;&#x62DF;&#x673A;&#x7684;&#x81EA;&#x52A8;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6765;&#x7BA1;&#x7406;
new&#x5173;&#x952E;&#x5B57; &#x662F;&#x8FD0;&#x884C;&#x65F6;&#x5728;Heap&#x91CC;&#x9762;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x3002;&#x6BCF;new&#x4E00;&#x6B21;&#x90FD;&#x4E00;&#x5B9A;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x5806;&#x6570;&#x636E;&#x4E0D;&#x5171;&#x4EAB;&#x3002;
&#x53EA;&#x8981;&#x662F;&#x7528;new()&#x6765;&#x65B0;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x90FD;&#x4F1A;&#x5728;&#x5806;&#x4E2D;&#x521B;&#x5EFA;&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5355;&#x72EC;&#x5B58;&#x503C;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x4E0E;&#x6808;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x76F8;&#x540C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E0E;&#x6808;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5171;&#x4EAB;&#x3002; </li>
</ul>
<p>&#x770B;&#x4E0B;&#x9762;&#x4EE3;&#x7801;</p>
<pre><code>public class A {

    int a = 0; // &#x6808;&#x5185;

    B b = new B(); // new B()&#x5806;&#x5185;  b&#x5728;&#x6808;&#x5185;
    public void test(){
        int a1 = 1;  //&#x6808;&#x5185;
        B b1 = new B(); // b1&#x5728;&#x6808;&#x5185; new B() &#x5728;&#x5806;&#x5185;
    }
}

A object = new A(); //object&#x6808;&#x5185;  new A() &#x5806;&#x5185;
</code></pre><p>A&#x7C7B;&#x5185;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x6808;&#x4E2D;&#xFF0C;&#x5305;&#x62EC;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;a1&#x548C;&#x5F15;&#x7528;&#x53D8;&#x91CF;b1&#xFF0C;b1&#x6307;&#x5411;&#x7684;B&#x5BF9;&#x8C61;&#x5B9E;&#x4F53;&#x5B58;&#x5728;&#x4E8E;&#x5806;&#x4E2D;</p>
<p>&#x5F15;&#x7528;&#x53D8;&#x91CF;object&#x5B58;&#x5728;&#x4E8E;&#x6808;&#x4E2D;&#xFF0C;&#x800C;object&#x6307;&#x5411;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F53;&#x5B58;&#x5728;&#x4E8E;&#x5806;&#x4E2D;&#x3002;new A &#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x6210;&#x5458;&#x53D8;&#x91CF;a&#x548C;b&#x5728;&#x6808;&#x5185;&#xFF08;&#x53E5;&#x67C4;&#xFF09;&#xFF0C;&#x800C;&#x5F15;&#x7528;&#x53D8;&#x91CF;b&#x6307;&#x5411;&#x7684;B&#x7C7B;&#x5BF9;&#x8C61;&#x5B9E;&#x4F53;&#x5B58;&#x5728;&#x4E8E;&#x5806;&#x4E2D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="1-02.java 常量池相关 String Integer.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Java 常量池相关">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Java内存分区","level":"1.2.1","depth":2,"next":{"title":"Java 常量池相关","level":"1.2.2","depth":2,"path":"Java/1-02.java 常量池相关 String Integer.md","ref":"Java/1-02.java 常量池相关 String Integer.md","articles":[]},"previous":{"title":"Java","level":"1.2","depth":1,"ref":"","articles":[{"title":"Java内存分区","level":"1.2.1","depth":2,"path":"Java/1-01.java内存分区.md","ref":"Java/1-01.java内存分区.md","articles":[]},{"title":"Java 常量池相关","level":"1.2.2","depth":2,"path":"Java/1-02.java 常量池相关 String Integer.md","ref":"Java/1-02.java 常量池相关 String Integer.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Java/1-01.java内存分区.md","mtime":"2020-08-26T03:22:03.283Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-08-30T15:42:05.558Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

